'use strict';

for(let i = 0; i < 5; i++) {
    var ex1 = 'Hello global';
    let ex2 = 'Hello';
    const ex3 = 'Hello block scope';
    console.log(ex3);// виведеться, так як змінна оголошена в тій же області видимості де відбувається звернення
}

console.log(ex1);// ex1 - виведеться, бо var не обмежений блочною областю видимості і ex1 підніметься
console.log(ex2);// ex2 - не виведеться, так як має блочну область видимості, і не підніметься, бо в глобальній області навіть не існує
console.log(ex3);// ex2 - не виведеться, так як має блочну область видимості, і не підніметься, бо в глобальній області навіть не існує