export default function Main() {
    return(
       <main className="flex-grow-1 p-3">
          <h2>React</h2>
          <p>
                React спрощує створення інтерактивних інтерфейсів. Вам потрібно лише описати, як різні частини інтерфейсу виглядають у кожному стані вашого додатку і React ефективно оновить та відрендерить лише потрібні компоненти, коли ваші дані зміняться.
                Декларативні інтерфейси роблять ваш код більш передбачуваним і його набагато легше налагоджувати.
          </p>
          <p>
            Створюйте інкапсульовані компоненти, які керують власним станом, а з них будуйте складні інтерфейси. Оскільки логіка компонентів написана на JavaScript, замість шаблонів, ви з легкістю можете передавати складні дані у вашому додатку і зберігати стан окремо від DOM.
          </p>
          <p>
            Створюйте інкапсульовані компоненти, які керують власним станом, а з них будуйте складні інтерфейси.
            Оскільки логіка компонентів написана на JavaScript, замість шаблонів, ви з легкістю можете передавати складні дані у вашому додатку і зберігати стан окремо від DOM.
          </p>
        </main>
    );
}